def sum_of_divisorse(num): #приема число num като вход и инициализира променлива резултат на 0. 
    result = 0             # Тази променлива ще съхранява сумата на делителите.
    for i in range(1,num+1): #итерира от 1 до num (включително). Цикълът използва обхвата range(1, num+1).
        if (num %i == 0):    #for кодът проверява дали num се дели на текущата стойност на i. 
                              # Ако num се дели на i без остатък (т.е. num % i == 0), това означава, че i е делител на num.
            result = result + i #Ако i е делител на num, кодът добавя i към променливата резултат.
    #връща крайната стойност на резултата, която представлява сумата от делителите на num.
    return result

print(sum_of_divisorse(8))
print(sum_of_divisorse(7))
print(sum_of_divisorse(1))
print(sum_of_divisorse(1000))


#В обобщение, кодът преминава през всички числа от 1 до num и проверява дали всяко число е делител на num.
#Ако дадено число е делител, то добавя това число към резултатната променлива.
#Накрая функцията връща сумата от всички делители.