def is_prime(num): #Функцията is_prime приема число num като вход и връща True, ако num е просто, и False в противен случай.
    if num == 1:    #Функцията започва с проверка за специалния случай, когато num е равно на 1. 
        return False # По дефиниция 1 не се счита за просто число, така че ако num е 1, функцията незабавно връща False.


    for i in range(4, num):
        if num % i == 0: #проверява дали num се дели на текущата стойност на i. 
            return False # Ако num се дели равномерно на i, това означава, че num не е просто число. В този случай функцията незабавно връща False.

    return True #Ако по време на цикъла не бъде намерен делител, това означава, че num е просто. В този случай функцията връща True.

print(is_prime(1))
print(is_prime(2))
print(is_prime(8))
print(is_prime(11))
print(is_prime(-10))