def contains_digit(num, digit):
    while num > 0:
        if num%10 == digit:
            return True
        num//=10 
    return False

print(contains_digit(123, 4))
print(contains_digit(42, 2))
print(contains_digit(1000, 0))
print(contains_digit(12346789, 5))



#Използваме цикъл „while“, за да обхождаме всяка цифра от „числото“. 
#Проверяваме дали последната цифра от `числото` е равна на `цифрата`, която търсим. 
#Ако е така, връщаме `True`.
#В противен случай премахваме последната цифра от „числото“, като извършваме целочислено деление на 10 и продължаваме да повтаряме. 
#Ако стигнем до края на цикъла, без да намерим „цифрата“, връщаме „False“.