def contains_digits(num, digits): #Функцията contains_digits приема два параметъра: num (цяло число) и digits (списък с цели числа).
    for digit in digits:          #Функцията итерира всяка цифра на елемента в списъка с цифри, като използва for цикъл.
        if str(digit) not in str(num): #За всяка цифра той проверява дали низовото представяне на цифрата (str(digit)) присъства в 
            return False                 # низовото представяне на num с помощта на оператора in. Той преобразува както цифрата, така и числото 
        return True                        # в низове с помощта на функцията str().
    
print(contains_digits(402123, [0, 3, 4]))

#преминава през всяка цифра в списъка с цифри и проверява дали всяка цифра присъства в низовото представяне на num. 
#Ако някоя цифра не бъде намерена, връща False. Ако всички цифри бъдат намерени, той връща True след завършване на цикъла.
