def biggest_difference(arr): #Функцията large_difference приема масив от цели числа arr като вход.
    min = arr[0]    #Той инициализира две променливи, min и max, към първия елемент на масива (arr[0]). 
    max = arr[0]    #Тези променливи ще проследяват минималните и максималните стойности, срещани в масива.

    for num in arr: #След това функцията преминава през всеки елемент num в масива, използвайки for цикъл.
        if num < min:  #Вътре в цикъла кодът проверява дали текущият num е по-малък от текущия min. 
           min = num   #Ако е, това означава, че num е нова минимална стойност. В този случай кодът актуализира стойността на min до num.

        if num > max:
            max = num
        
    return max - min    #След итерация през всички елементи в масива, функцията връща разликата между max и min. 
                        # Това представлява най-голямата разлика между всеки две числа в масива.

print(biggest_difference([1, 2, 3, 4, 5]))


#В обобщение, тази реализация намира минималните и максималните стойности в дадения масив чрез итерация през елементите
#и съответно актуализиране на min_num и max_num. Накрая връща разликата между максималната и минималната стойност, 
#която представлява най-голямата разлика между всеки две числа в масива.